emacsy/doodoo.org
#+TITLE: DooDoo
#+AUTHOR: Frederic Boileau

* basic
:PROPERTIES:
:header-args: :tangle yes
:END:

** preamble
#+BEGIN_SRC elisp
;;; package --- doodoo
;;; Commentary:
;;; summary: private config of Doom
;;; Code:
#+END_SRC


** basic basic

#+BEGIN_SRC elisp
;; Set default font
(set-face-attribute 'default nil
                    :family "Inconsolata"
                    :height 110
                    :weight 'normal
                    :width 'normal)
(setq  inferior-julia-program-name "/usr/bin/julia")
(setq python-python-command "/usr/bin/ipython")
(ranger-override-dired-mode t)
(setq org-cycle-separator-lines 2)
(require 'doom-themes)
(setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
      doom-themes-enable-italic t) ; if nil, italics is universally disabled
(doom-themes-org-config)
(setq-default tab-width 2)
(setq c-basic-indent 2)
(set-frame-parameter (selected-frame) 'alpha '(100 . 90))
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(global-set-key (kbd "C-x C-b") 'ibuffer)
(autoload 'ibuffer "ibuffer" "List buffers." t)
(setq org-cycle-separator-lines 2)
(bind-key (kbd "M-y") 'helm-show-kill-ring)
(bind-key (kbd "M-o") 'company-complete)
(global-set-key (kbd "M-p") nil)
(bind-key (kbd "M-p l") 'org-cliplink)
(load-theme 'doom-city-lights)
#+END_SRC



** emacs xdg
#+begin_src elisp
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "brave")
#+end_src

#+RESULTS:
: brave


** searching

*** swiper/ivy :melpa:github:
:PROPERTIES:
:GH:       https://github.com/abo-abo/swiper
:END:

**** small config example from github
#+begin_src elisp :tangle yes :results replace
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
;; enable this if you want `swiper' to use it
;; (setq search-default-mode #'char-fold-to-regexp)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c f") 'counsel-fzf)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
#+end_src

#+RESULTS:
: counsel-locate

- http://develop.spacemacs.org/layers/+completion/ivy/README.html


*** rg :melpa:github:broken:
:PROPERTIES:
:GH:       https://github.com/dajva/rg.el
:header-args: :tangle yes
:END:
#+BEGIN_SRC elisp
(use-package rg
  :bind ("C-c l" . counsel-rg)
  :config
  (rg-enable-default-bindings))
#+END_SRC

#+RESULTS:
: counsel-rg


** doom modeline :melpa:github:doom:
:PROPERTIES:
:header-args: :tangle yes
:GH:       https://github.com/abo-abo/swiper
:END:
#+BEGIN_SRC elisp
(require 'doom-modeline)
(doom-modeline-mode 1)
#+end_src

