emacsy/doodoo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-18 Thu 00:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DooDoo</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Frederic Boileau" />
</head>
<body>
<div id="content">
<h1 class="title">DooDoo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb95991c">1. basic</a>
<ul>
<li><a href="#orgb70f5ad">1.1. preamble</a></li>
<li><a href="#org86a1e33">1.2. basic basic</a></li>
<li><a href="#orgd48a076">1.3. emacs xdg</a></li>
<li><a href="#orgb75958c">1.4. searching</a>
<ul>
<li><a href="#orgad7d2cb">1.4.1. swiper/ivy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span></span></a></li>
<li><a href="#orgc9e0957">1.4.2. rg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span>&#xa0;<span class="broken">broken</span></span></a></li>
</ul>
</li>
<li><a href="#org16384d3">1.5. doom modeline&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span>&#xa0;<span class="doom">doom</span></span></a>
<ul>
<li><a href="#orgc0d38db">1.5.1. customize</a></li>
</ul>
</li>
<li><a href="#org067621f">1.6. babel</a></li>
<li><a href="#org228b0f9">1.7. org faces</a></li>
<li><a href="#orgd1b957d">1.8. bib stuff</a></li>
<li><a href="#orga4ac9a3">1.9. evil interactive</a></li>
</ul>
</li>
<li><a href="#orgb7e7d44">2. completion</a></li>
<li><a href="#org0fe3a41">3. org</a>
<ul>
<li><a href="#orgb4404c0">3.1. toc org</a></li>
<li><a href="#org8fd24ee">3.2. org publish</a>
<ul>
<li><a href="#org098369c">3.2.1. mathjax</a></li>
</ul>
</li>
<li><a href="#orgd87ed7b">3.3. <span class="todo IDEA">IDEA</span> org keywords</a></li>
<li><a href="#org48290fa">3.4. capture</a></li>
<li><a href="#org674b13f">3.5. youtube embed</a></li>
</ul>
</li>
<li><a href="#org3a05fcf">4. <span class="todo TODO">TODO</span> snippets</a></li>
<li><a href="#org905d999">5. keybindings</a></li>
<li><a href="#org3f732e9">6. evil&#xa0;&#xa0;&#xa0;<span class="tag"><span class="interactive">interactive</span></span></a></li>
<li><a href="#org54826fb">7. configs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb95991c" class="outline-2">
<h2 id="orgb95991c"><span class="section-number-2">1</span> basic</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-orgb70f5ad" class="outline-3">
<h3 id="orgb70f5ad"><span class="section-number-3">1.1</span> preamble</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #56697A;">;;; </span><span style="color: #56697A;">package --- doodoo</span>
<span style="color: #56697A;">;;; </span><span style="color: #56697A;">Commentary:</span>
<span style="color: #56697A;">;;; </span><span style="color: #56697A;">summary: private config of Doom</span>
<span style="color: #56697A;">;;; </span><span style="color: #56697A;">Code:</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org86a1e33" class="outline-3">
<h3 id="org86a1e33"><span class="section-number-3">1.2</span> basic basic</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #56697A;">;; </span><span style="color: #56697A;">Set default font</span>
(set-face-attribute 'default nil
                    <span style="color: #5EC4FF;">:family</span> <span style="color: #7FA0B7;">"Inconsolata"</span>
                    <span style="color: #5EC4FF;">:height</span> <span style="color: #E27E8D; font-weight: bold;">110</span>
                    <span style="color: #5EC4FF;">:weight</span> 'normal
                    <span style="color: #5EC4FF;">:width</span> 'normal)
(<span style="color: #5EC4FF;">setq</span>  inferior-julia-program-name <span style="color: #7FA0B7;">"/usr/bin/julia"</span>)
(<span style="color: #5EC4FF;">setq</span> python-python-command <span style="color: #7FA0B7;">"/usr/bin/ipython"</span>)
(ranger-override-dired-mode t)
(<span style="color: #5EC4FF;">setq</span> org-cycle-separator-lines <span style="color: #E27E8D; font-weight: bold;">2</span>)
(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">doom-themes</span>)
(<span style="color: #5EC4FF;">setq</span> doom-themes-enable-bold t    <span style="color: #56697A;">; </span><span style="color: #56697A;">if nil, bold is universally disabled</span>
      doom-themes-enable-italic t) <span style="color: #56697A;">; </span><span style="color: #56697A;">if nil, italics is universally disabled</span>
(doom-themes-org-config)
(<span style="color: #5EC4FF;">setq-default</span> tab-width <span style="color: #E27E8D; font-weight: bold;">2</span>)
(<span style="color: #5EC4FF;">setq</span> c-basic-indent <span style="color: #E27E8D; font-weight: bold;">2</span>)
(set-frame-parameter (selected-frame) 'alpha '(<span style="color: #E27E8D; font-weight: bold;">100</span> . <span style="color: #E27E8D; font-weight: bold;">90</span>))
(<span style="color: #5EC4FF;">setq</span> mouse-wheel-scroll-amount '(<span style="color: #E27E8D; font-weight: bold;">1</span> ((shift) . <span style="color: #E27E8D; font-weight: bold;">1</span>))) <span style="color: #56697A;">;; </span><span style="color: #56697A;">one line at a time</span>
(<span style="color: #5EC4FF;">setq</span> mouse-wheel-progressive-speed nil) <span style="color: #56697A;">;; </span><span style="color: #56697A;">don't accelerate scrolling</span>
(<span style="color: #5EC4FF;">setq</span> mouse-wheel-follow-mouse 't) <span style="color: #56697A;">;; </span><span style="color: #56697A;">scroll window under mouse</span>
(global-set-key (kbd <span style="color: #7FA0B7;">"C-x C-b"</span>) 'ibuffer)
(autoload 'ibuffer <span style="color: #7FA0B7;">"ibuffer"</span> <span style="color: #808e9b;">"List buffers."</span> t)
(<span style="color: #5EC4FF;">setq</span> org-cycle-separator-lines <span style="color: #E27E8D; font-weight: bold;">2</span>)
(<span style="color: #5EC4FF;">bind-key</span> (kbd <span style="color: #7FA0B7;">"M-y"</span>) 'helm-show-kill-ring)
(<span style="color: #5EC4FF;">bind-key</span> (kbd <span style="color: #7FA0B7;">"M-p"</span>) 'company-complete)
(load-theme 'doom-city-lights)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd48a076" class="outline-3">
<h3 id="orgd48a076"><span class="section-number-3">1.3</span> emacs xdg</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">setq</span> browse-url-browser-function 'browse-url-generic
      browse-url-generic-program <span style="color: #7FA0B7;">"brave"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb75958c" class="outline-3">
<h3 id="orgb75958c"><span class="section-number-3">1.4</span> searching</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgad7d2cb" class="outline-4">
<h4 id="orgad7d2cb"><span class="section-number-4">1.4.1</span> swiper/ivy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span></span></h4>
<div class="outline-text-4" id="text-1-4-1">
</div>

<ol class="org-ol">
<li><a id="org1be9bac"></a>small config example from github<br />
<div class="outline-text-5" id="text-1-4-1-1">
<div class="org-src-container">
<pre class="src src-elisp">(ivy-mode <span style="color: #E27E8D; font-weight: bold;">1</span>)
(<span style="color: #5EC4FF;">setq</span> ivy-use-virtual-buffers t)
(<span style="color: #5EC4FF;">setq</span> enable-recursive-minibuffers t)
<span style="color: #56697A;">;; </span><span style="color: #56697A;">enable this if you want `</span><span style="color: #D95468;">swiper</span><span style="color: #56697A;">' to use it</span>
<span style="color: #56697A;">;; </span><span style="color: #56697A;">(setq search-default-mode #'char-fold-to-regexp)</span>
(global-set-key <span style="color: #7FA0B7;">"\C-s"</span> 'swiper)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c C-r"</span>) 'ivy-resume)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f6&gt;"</span>) 'ivy-resume)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-x C-f"</span>) 'counsel-find-file)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f1&gt; f"</span>) 'counsel-describe-function)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f1&gt; v"</span>) 'counsel-describe-variable)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f1&gt; l"</span>) 'counsel-find-library)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f2&gt; i"</span>) 'counsel-info-lookup-symbol)
(global-set-key (kbd <span style="color: #7FA0B7;">"&lt;f2&gt; u"</span>) 'counsel-unicode-char)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c g"</span>) 'counsel-git)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c f"</span>) 'counsel-fzf)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c j"</span>) 'counsel-git-grep)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c k"</span>) 'counsel-ag)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-x l"</span>) 'counsel-locate)
</pre>
</div>

<ul class="org-ul">
<li><a href="http://develop.spacemacs.org/layers/+completion/ivy/README.html">http://develop.spacemacs.org/layers/+completion/ivy/README.html</a></li>
</ul>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgc9e0957" class="outline-4">
<h4 id="orgc9e0957"><span class="section-number-4">1.4.2</span> rg&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span>&#xa0;<span class="broken">broken</span></span></h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">use-package</span> rg
  <span style="color: #5EC4FF;">:bind</span> (<span style="color: #7FA0B7;">"C-c l"</span> . counsel-rg)
  <span style="color: #5EC4FF;">:config</span>
  (rg-enable-default-bindings))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org16384d3" class="outline-3">
<h3 id="org16384d3"><span class="section-number-3">1.5</span> doom modeline&#xa0;&#xa0;&#xa0;<span class="tag"><span class="melpa">melpa</span>&#xa0;<span class="github">github</span>&#xa0;<span class="doom">doom</span></span></h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">doom-modeline</span>)
(doom-modeline-mode <span style="color: #E27E8D; font-weight: bold;">1</span>)
</pre>
</div>
</div>
