emacsy/doodoo.html

<div id="outline-container-orgc0d38db" class="outline-4">
<h4 id="orgc0d38db"><span class="section-number-4">1.5.1</span> customize</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">setq</span> doom-modeline-height <span style="color: #E27E8D; font-weight: bold;">25</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-bar-width <span style="color: #E27E8D; font-weight: bold;">3</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-buffer-file-name-style 'truncate-upto-project)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-icon t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-major-mode-icon t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-major-mode-color-icon t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-persp-name t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-buffer-state-icon t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-buffer-modification-icon t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-minor-modes nil)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-enable-word-count nil)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-buffer-encoding t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-indent-info nil)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-checker-simple-format t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-vcs-max-length <span style="color: #E27E8D; font-weight: bold;">12</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-persp-name t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-lsp t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-github nil)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-github-interval (* <span style="color: #E27E8D; font-weight: bold;">30</span> <span style="color: #E27E8D; font-weight: bold;">60</span>))
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-version t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-python t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-ruby t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-perl t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-go t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-elixir t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-enable-rust t)

<span style="color: #56697A;">;; </span><span style="color: #56697A;">Change the executables to use for the language version string</span>
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-python-executable <span style="color: #7FA0B7;">"python"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-ruby-executable <span style="color: #7FA0B7;">"ruby"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-perl-executable <span style="color: #7FA0B7;">"perl"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-go-executable <span style="color: #7FA0B7;">"go"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-elixir-executable <span style="color: #7FA0B7;">"iex"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-env-rust-executable <span style="color: #7FA0B7;">"rustc"</span>)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-mu4e t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-irc t)
(<span style="color: #5EC4FF;">setq</span> doom-modeline-irc-stylize 'identity)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org067621f" class="outline-3">
<h3 id="org067621f"><span class="section-number-3">1.6</span> babel</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">ob-shell</span>)
(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">org-tempo</span>)
(<span style="color: #5EC4FF;">setq</span> tempo-interactive t)
(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">ox-md</span>)
(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">julia-repl</span>)
(add-hook 'julia-mode-hook 'julia-repl-mode)
(<span style="color: #5EC4FF;">with-eval-after-load</span> <span style="color: #7FA0B7;">"ob"</span>
  (<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">org-babel-eval-in-repl</span>))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (julia . t)
   (shell . t)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(tempo-define-template <span style="color: #7FA0B7;">"my-property"</span>
                       '(<span style="color: #7FA0B7;">":PROPERTIES:"</span> p <span style="color: #7FA0B7;">":END:"</span> &gt;)
                       <span style="color: #7FA0B7;">"&lt;p"</span>
                       <span style="color: #7FA0B7;">"Insert a property tempate"</span>)
(tempo-define-template <span style="color: #7FA0B7;">"name"</span>
                       '(<span style="color: #7FA0B7;">"#+NAME:"</span> (p <span style="color: #7FA0B7;">"Name : "</span> name)  n)
                       <span style="color: #7FA0B7;">"&lt;n"</span>
                       <span style="color: #7FA0B7;">"Insert name"</span>)
</pre>
</div>
</div>
</div>




<div id="outline-container-org228b0f9" class="outline-3">
<h3 id="org228b0f9"><span class="section-number-3">1.7</span> org faces</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">use-package</span> org-faces
  <span style="color: #5EC4FF;">:after</span> org
  <span style="color: #5EC4FF;">:custom</span>
  (org-todo-keyword-faces
   '((<span style="color: #7FA0B7;">"DONE"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"cyan"</span> <span style="color: #5EC4FF;">:weight</span> bold))
     (<span style="color: #7FA0B7;">"SOMEDAY"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"gray"</span> <span style="color: #5EC4FF;">:weight</span> bold))
     (<span style="color: #7FA0B7;">"WAITING"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"red"</span> <span style="color: #5EC4FF;">:weight</span> bold))
     (<span style="color: #7FA0B7;">"STARTED"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"cyan"</span> <span style="color: #5EC4FF;">:weight</span> normal))
     (<span style="color: #7FA0B7;">"NEXT"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"cyan"</span> <span style="color: #5EC4FF;">:weight</span> bold)))))
</pre>
</div>


<p>
Install Source Sans Pro."))))
     (base-font-color (face-foreground 'default nil 'default))
     (headline       `(:inherit default :weight normal :foreground ,base-font-color)))
</p>

<p>
  (custom-theme-set-faces
   'user
   `(org-level-8        ((t (,@headline ,@variable-tuple))))
   `(org-level-7        ((t (,@headline ,@variable-tuple))))
   `(org-level-6        ((t (,@headline ,@variable-tuple))))
   `(org-level-5        ((t (,@headline ,@variable-tuple))))
   `(org-level-4        ((t (,@headline ,@variable-tuple :height 1.2))))
   `(org-level-3        ((t (,@headline ,@variable-tuple :height 1.25))))
   `(org-level-2        ((t (,@headline ,@variable-tuple :height 1.5))))
   `(org-level-1        ((t (,@headline ,@variable-tuple :height 1.70))))
   `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil))))))
#+END<sub>SRC</sub>
</p>
</div>
</div>


<div id="outline-container-orgd1b957d" class="outline-3">
<h3 id="orgd1b957d"><span class="section-number-3">1.8</span> bib stuff</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">setq</span> reftex-default-bibliography '(<span style="color: #7FA0B7;">"~/.personal/.bibstuff/master-biblio.bib"</span>))

(<span style="color: #5EC4FF;">setq</span> org-ref-bibliography-notes <span style="color: #7FA0B7;">"~/.personal/.bibstuff/orgRefNotes.org"</span>
      org-ref-default-bibliography '(<span style="color: #7FA0B7;">"~/.personal/.bibstuff/master-bib.bib"</span>)
      org-ref-pdf-directory <span style="color: #7FA0B7;">"~/.personal/zotero/storage/"</span>)

(<span style="color: #5EC4FF;">setq</span> bibtex-completion-bibliography '(<span style="color: #7FA0B7;">"~/.personal/.bibstuff/master-bib.bib"</span>)
      bibtex-completion-library-path <span style="color: #7FA0B7;">"~/.personal/zotero/storage"</span>
      bibtex-completion-notes-path <span style="color: #7FA0B7;">"~/.personal/.bibstuff/helm-bibtex-notes"</span>)

(<span style="color: #5EC4FF;">setq</span> bibtex-completion-pdf-field <span style="color: #7FA0B7;">"file"</span>)
(<span style="color: #5EC4FF;">setq</span> bibtex-completion-pdf-open-function
      (<span style="color: #5EC4FF;">lambda</span> (fpath)
        (start-process <span style="color: #7FA0B7;">"evince"</span> <span style="color: #7FA0B7;">"*helm-bibtex-evince*"</span> <span style="color: #7FA0B7;">"/usr/bin/evince"</span>
                       fpath)))

(<span style="color: #5EC4FF;">setq</span> bibtex-dialect 'biblatex)

(<span style="color: #5EC4FF;">setq</span> bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-org-link-to-PDF)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
        (default       . bibtex-completion-format-citation-default)))
</pre>
</div>
</div>
</div>
