emacsy/doodoo.html



<div id="outline-container-orga4ac9a3" class="outline-3">
<h3 id="orga4ac9a3"><span class="section-number-3">1.9</span> evil interactive</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">evil-define-key</span> nil evil-insert-state-map
  <span style="color: #7FA0B7;">"\C-n"</span> 'evil-next-visual-line
  <span style="color: #7FA0B7;">"\C-p"</span> 'evil-previous-visual-line
  <span style="color: #7FA0B7;">"\C-f"</span> 'evil-forward-char
  <span style="color: #7FA0B7;">"\C-b"</span> 'evil-backward-char
  <span style="color: #7FA0B7;">"\C-k"</span> 'kill-line)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb7e7d44" class="outline-2">
<h2 id="orgb7e7d44"><span class="section-number-2">2</span> completion</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">use-package</span> company
  <span style="color: #5EC4FF;">:defer</span> <span style="color: #E27E8D; font-weight: bold;">2</span>
  <span style="color: #5EC4FF;">:diminish</span>
  <span style="color: #5EC4FF;">:custom</span>
  (company-begin-commands '(self-insert-command))
  (company-idle-delay <span style="color: #E27E8D; font-weight: bold;">.1</span>)
  (company-minimum-prefix-length <span style="color: #E27E8D; font-weight: bold;">2</span>)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">company-box-mode</td>
<td class="org-left">evil-normalize-keymaps</td>
<td class="org-left">+company</td>
<td class="org-left">init-backends</td>
<td class="org-left">company-mode-set-explicitly</td>
<td class="org-left">company-prescient-mode</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org0fe3a41" class="outline-2">
<h2 id="org0fe3a41"><span class="section-number-2">3</span> org</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb4404c0" class="outline-3">
<h3 id="orgb4404c0"><span class="section-number-3">3.1</span> toc org</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">if</span> (<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">toc-org</span> nil t)
    (add-hook 'org-mode-hook 'toc-org-mode)
  (<span style="color: #EBBF83;">warn</span> <span style="color: #7FA0B7;">"toc-org not found"</span>))
</pre>
</div>
</div>
</div>
