emacsy/doodoo.org
**  org publish
#+BEGIN_SRC elisp
(require 'ox-publish)
(setq org-publish-project-alist
      '(("org-notes"
         :base-directory "~/.personal/org/"
         :base-extension "org"
         :publishing-directory "~/.personal/public_html/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4             ; Just the default for this project.
         :auto-preamble t)
        ("org-static"
         :base-directory "~/.personal/org/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/.personal/public_html/"
         :recursive t
         :publishing-function org-publish-attachment)

        ("org" :components ("org-notes" "org-static"))

        ("spirou-inherit"
         :base-directory "~/.personal/org/"
         :recursive t
         :base-extension "css\\|js"
         :publishing-directory "~/spirou/publish"
         :publishing-function org-publish-attachment
         )

        ("spip-org"
         :base-directory "~/spirou/spip_ocr"
         :auto-index t
         :index-filename "sitemap.org"
         :index-title "Sitemap"
         :recursive t
         :base-extension "org"
         :publishing-directory "~/spirou/publish"
         :publishing-function org-html-publish-to-html
         :headline-levels 3
         :auto-preamble t
         )
        ("spirou-static"
         :base-directory "~/spirou/static/"
         :recursive t
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/spirou/publish/"
         :publishing-function org-publish-attachment)

        ("spirou" :components ("spirou-inherit" "spip-org" "spirou-static"))))
#+END_SRC

#+RESULTS:
| org-notes      | :base-directory | ~/.personal/org/                        | :base-extension | org  | :publishing-directory | ~/.personal/public_html/ | :recursive   | t                     | :publishing-function | org-html-publish-to-html | :headline-levels       | 4    | :auto-preamble        | t                        |                       |                          |                      |                        |                |   |
| org-static     | :base-directory | ~/.personal/org/                        | :base-extension | css\ | js\                   | png\                     | jpg\         | gif\                  | pdf\                 | mp3\                     | ogg\                   | swf  | :publishing-directory | ~/.personal/public_html/ | :recursive            | t                        | :publishing-function | org-publish-attachment |                |   |
| org            | :components     | (org-notes org-static)                  |                 |      |                       |                          |              |                       |                      |                          |                        |      |                       |                          |                       |                          |                      |                        |                |   |
| spirou-inherit | :base-directory | ~/.personal/org/                        | :recursive      | t    | :base-extension       | css\                     | js           | :publishing-directory | ~/spirou/publish     | :publishing-function     | org-publish-attachment |      |                       |                          |                       |                          |                      |                        |                |   |
| spip-org       | :base-directory | ~/spirou/spip_ocr                       | :auto-index     | t    | :index-filename       | sitemap.org              | :index-title | Sitemap               | :recursive           | t                        | :base-extension        | org  | :publishing-directory | ~/spirou/publish         | :publishing-function  | org-html-publish-to-html | :headline-levels     | 3                      | :auto-preamble | t |
| spirou-static  | :base-directory | ~/spirou/static/                        | :recursive      | t    | :base-extension       | css\                     | js\          | png\                  | jpg\                 | gif\                     | pdf\                   | mp3\ | ogg\                  | swf                      | :publishing-directory | ~/spirou/publish/        | :publishing-function | org-publish-attachment |                |   |
| spirou         | :components     | (spirou-inherit spip-org spirou-static) |                 |      |                       |                          |              |                       |                      |                          |                        |      |                       |                          |                       |                          |                      |                        |                |   |

#+BEGIN_SRC elisp
(defun org-blog-prepare (project-plist)
  "With help from `https://github.com/howardabrams/dot-files'.
  Touch `index.org' to rebuilt it.
  Argument `PROJECT-PLIST' contains information about the current project."
  (let* ((base-directory (plist-get project-plist :base-directory))
         (buffer (find-file-noselect (expand-file-name "index.org" base-directory) t)))
    (with-current-buffer buffer
      (set-buffer-modified-p t)
      (save-buffer 0))
    (kill-buffer buffer)))
#+END_SRC
#+BEGIN_SRC elisp
(defvar org-blog-head
  "<link rel=\"stylesheet\" type=\"text/css\" href=\"/assets/css/bootstrap.css\"/>
  <link rel=\"stylesheet\" type=\"text/css\" href=\"https://fonts.googleapis.com/css?family=Amaranth|Handlee|Libre+Baskerville|Bree+Serif|Ubuntu+Mono|Pacifico&subset=latin,greek\"/>
  <link rel=\"shortcut icon\" type=\"image/x-icon\" href=\"favicon.ico\">")
#+END_SRC

#+BEGIN_SRC elisp

#+END_SRC
#+RESULTS:
: org-blog-head

