emacsy/doodoo.html


<div id="outline-container-org8fd24ee" class="outline-3">
<h3 id="org8fd24ee"><span class="section-number-3">3.2</span> org publish</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">ox-publish</span>)
(<span style="color: #5EC4FF;">setq</span> org-publish-project-alist
      '((<span style="color: #7FA0B7;">"org-notes"</span>
         <span style="color: #5EC4FF;">:base-directory</span> <span style="color: #7FA0B7;">"~/.personal/org/"</span>
         <span style="color: #5EC4FF;">:base-extension</span> <span style="color: #7FA0B7;">"org"</span>
         <span style="color: #5EC4FF;">:publishing-directory</span> <span style="color: #7FA0B7;">"~/.personal/public_html/"</span>
         <span style="color: #5EC4FF;">:recursive</span> t
         <span style="color: #5EC4FF;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #5EC4FF;">:headline-levels</span> <span style="color: #E27E8D; font-weight: bold;">4</span>             <span style="color: #56697A;">; </span><span style="color: #56697A;">Just the default for this project.</span>
         <span style="color: #5EC4FF;">:auto-preamble</span> t)
        (<span style="color: #7FA0B7;">"org-static"</span>
         <span style="color: #5EC4FF;">:base-directory</span> <span style="color: #7FA0B7;">"~/.personal/org/"</span>
         <span style="color: #5EC4FF;">:base-extension</span> <span style="color: #7FA0B7;">"css</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">js</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">png</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">jpg</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">gif</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">pdf</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">mp3</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">ogg</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">swf"</span>
         <span style="color: #5EC4FF;">:publishing-directory</span> <span style="color: #7FA0B7;">"~/.personal/public_html/"</span>
         <span style="color: #5EC4FF;">:recursive</span> t
         <span style="color: #5EC4FF;">:publishing-function</span> org-publish-attachment)

        (<span style="color: #7FA0B7;">"org"</span> <span style="color: #5EC4FF;">:components</span> (<span style="color: #7FA0B7;">"org-notes"</span> <span style="color: #7FA0B7;">"org-static"</span>))

        (<span style="color: #7FA0B7;">"spirou-inherit"</span>
         <span style="color: #5EC4FF;">:base-directory</span> <span style="color: #7FA0B7;">"~/.personal/org/"</span>
         <span style="color: #5EC4FF;">:recursive</span> t
         <span style="color: #5EC4FF;">:base-extension</span> <span style="color: #7FA0B7;">"css</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">js"</span>
         <span style="color: #5EC4FF;">:publishing-directory</span> <span style="color: #7FA0B7;">"~/spirou/publish"</span>
         <span style="color: #5EC4FF;">:publishing-function</span> org-publish-attachment
         )

        (<span style="color: #7FA0B7;">"spip-org"</span>
         <span style="color: #5EC4FF;">:base-directory</span> <span style="color: #7FA0B7;">"~/spirou/spip_ocr"</span>
         <span style="color: #5EC4FF;">:auto-index</span> t
         <span style="color: #5EC4FF;">:index-filename</span> <span style="color: #7FA0B7;">"sitemap.org"</span>
         <span style="color: #5EC4FF;">:index-title</span> <span style="color: #7FA0B7;">"Sitemap"</span>
         <span style="color: #5EC4FF;">:recursive</span> t
         <span style="color: #5EC4FF;">:base-extension</span> <span style="color: #7FA0B7;">"org"</span>
         <span style="color: #5EC4FF;">:publishing-directory</span> <span style="color: #7FA0B7;">"~/spirou/publish"</span>
         <span style="color: #5EC4FF;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #5EC4FF;">:headline-levels</span> <span style="color: #E27E8D; font-weight: bold;">3</span>
         <span style="color: #5EC4FF;">:auto-preamble</span> t
         )
        (<span style="color: #7FA0B7;">"spirou-static"</span>
         <span style="color: #5EC4FF;">:base-directory</span> <span style="color: #7FA0B7;">"~/spirou/static/"</span>
         <span style="color: #5EC4FF;">:recursive</span> t
         <span style="color: #5EC4FF;">:base-extension</span> <span style="color: #7FA0B7;">"css</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">js</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">png</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">jpg</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">gif</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">pdf</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">mp3</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">ogg</span><span style="color: #5EC4FF; font-weight: bold;">\\</span><span style="color: #5EC4FF; font-weight: bold;">|</span><span style="color: #7FA0B7;">swf"</span>
         <span style="color: #5EC4FF;">:publishing-directory</span> <span style="color: #7FA0B7;">"~/spirou/publish/"</span>
         <span style="color: #5EC4FF;">:publishing-function</span> org-publish-attachment)

        (<span style="color: #7FA0B7;">"spirou"</span> <span style="color: #5EC4FF;">:components</span> (<span style="color: #7FA0B7;">"spirou-inherit"</span> <span style="color: #7FA0B7;">"spip-org"</span> <span style="color: #7FA0B7;">"spirou-static"</span>))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">defun</span> <span style="color: #4db5bd;">org-blog-prepare</span> (project-plist)
  <span style="color: #808e9b;">"With help from `</span><span style="color: #D95468;">https://github.com/howardabrams/dot-files</span><span style="color: #808e9b;">'.</span>
<span style="color: #808e9b;">  Touch `</span><span style="color: #D95468;">index.org</span><span style="color: #808e9b;">' to rebuilt it.</span>
<span style="color: #808e9b;">  Argument `</span><span style="color: #D95468;">PROJECT-PLIST</span><span style="color: #808e9b;">' contains information about the current project."</span>
  (<span style="color: #5EC4FF;">let*</span> ((base-directory (plist-get project-plist <span style="color: #5EC4FF;">:base-directory</span>))
         (buffer (find-file-noselect (expand-file-name <span style="color: #7FA0B7;">"index.org"</span> base-directory) t)))
    (<span style="color: #5EC4FF;">with-current-buffer</span> buffer
      (set-buffer-modified-p t)
      (save-buffer <span style="color: #E27E8D; font-weight: bold;">0</span>))
    (kill-buffer buffer)))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">defvar</span> <span style="color: #9CAABB;">org-blog-head</span>
  <span style="color: #7FA0B7;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"/assets/css/bootstrap.css\"/&gt;</span>
<span style="color: #7FA0B7;">  &lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://fonts.googleapis.com/css?family=Amaranth|Handlee|Libre+Baskerville|Bree+Serif|Ubuntu+Mono|Pacifico&amp;subset=latin,greek\"/&gt;</span>
<span style="color: #7FA0B7;">  &lt;link rel=\"shortcut icon\" type=\"image/x-icon\" href=\"favicon.ico\"&gt;"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">
</pre>
</div>
</div>
