emacsy/doodoo.html

<div id="outline-container-org098369c" class="outline-4">
<h4 id="org098369c"><span class="section-number-4">3.2.1</span> mathjax</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">setf</span> org-html-mathjax-options
      '((path <span style="color: #7FA0B7;">"https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"</span>)
        (scale <span style="color: #7FA0B7;">"100"</span>)
        (align <span style="color: #7FA0B7;">"center"</span>)
        (indent <span style="color: #7FA0B7;">"2em"</span>)
        (mathml nil))
      )
(<span style="color: #5EC4FF;">setf</span> org-html-mathjax-template
      <span style="color: #7FA0B7;">"&lt;script type=\"text/javascript\" src=\"%PATH\"&gt;&lt;/script&gt;"</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd87ed7b" class="outline-3">
<h3 id="orgd87ed7b"><span class="section-number-3">3.3</span> <span class="todo IDEA">IDEA</span> org keywords</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">setq</span> org-todo-keywords
      '(
        (sequence <span style="color: #7FA0B7;">"IDEA(i)"</span> <span style="color: #7FA0B7;">"</span>TODO<span style="color: #7FA0B7;">(t)"</span> <span style="color: #7FA0B7;">"STARTED(s)"</span> <span style="color: #7FA0B7;">"NEXT(n)"</span> <span style="color: #7FA0B7;">"WAITING(w)"</span> <span style="color: #7FA0B7;">"|"</span> <span style="color: #7FA0B7;">"DONE(d)"</span>)
        (sequence <span style="color: #7FA0B7;">"|"</span> <span style="color: #7FA0B7;">"CANCELED(c)"</span> <span style="color: #7FA0B7;">"DELEGATED(l)"</span> <span style="color: #7FA0B7;">"SOMEDAY(f)"</span>)
        ))

(<span style="color: #5EC4FF;">setq</span> org-todo-keyword-faces
      '((<span style="color: #7FA0B7;">"IDEA"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"GoldenRod"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"NEXT"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"IndianRed1"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"STARTED"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"OrangeRed"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"WAITING"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"coral"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"CANCELED"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"LimeGreen"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"DELEGATED"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"LimeGreen"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"SOMEDAY"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"LimeGreen"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        ))

(<span style="color: #5EC4FF;">setq</span> org-tag-persistent-alist
      '((<span style="color: #5EC4FF;">:startgroup</span> . nil)
        (<span style="color: #7FA0B7;">"HOME"</span> . ?h)
        (<span style="color: #7FA0B7;">"RESEARCH"</span> . ?r)
        (<span style="color: #7FA0B7;">"TEACHING"</span> . ?t)
        (<span style="color: #5EC4FF;">:endgroup</span> . nil)
        (<span style="color: #5EC4FF;">:startgroup</span> . nil)
        (<span style="color: #7FA0B7;">"OS"</span> . ?o)
        (<span style="color: #7FA0B7;">"DEV"</span> . ?d)
        (<span style="color: #7FA0B7;">"WWW"</span> . ?w)
        (<span style="color: #5EC4FF;">:endgroup</span> . nil)
        (<span style="color: #5EC4FF;">:startgroup</span> . nil)
        (<span style="color: #7FA0B7;">"EASY"</span> . ?e)
        (<span style="color: #7FA0B7;">"MEDIUM"</span> . ?m)
        (<span style="color: #7FA0B7;">"HARD"</span> . ?a)
        (<span style="color: #5EC4FF;">:endgroup</span> . nil)
        (<span style="color: #7FA0B7;">"URGENT"</span> . ?u)
        (<span style="color: #7FA0B7;">"KEY"</span> . ?k)
        (<span style="color: #7FA0B7;">"BONUS"</span> . ?b)
        (<span style="color: #7FA0B7;">"noexport"</span> . ?x)
        )
      )

(<span style="color: #5EC4FF;">setq</span> org-tag-faces
      '(
        (<span style="color: #7FA0B7;">"HOME"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"GoldenRod"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"RESEARCH"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"GoldenRod"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"TEACHING"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"GoldenRod"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"OS"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"IndianRed1"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"DEV"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"IndianRed1"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"WWW"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"IndianRed1"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"URGENT"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"Red"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"KEY"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"Red"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"EASY"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"OrangeRed"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"MEDIUM"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"OrangeRed"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"HARD"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"OrangeRed"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"BONUS"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"GoldenRod"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        (<span style="color: #7FA0B7;">"noexport"</span> . (<span style="color: #5EC4FF;">:foreground</span> <span style="color: #7FA0B7;">"LimeGreen"</span> <span style="color: #5EC4FF;">:weight</span> bold))
        )
)
</pre>
</div>
</div>
</div>


<div id="outline-container-org48290fa" class="outline-3">
<h3 id="org48290fa"><span class="section-number-3">3.4</span> capture</h3>
</div>


<div id="outline-container-org674b13f" class="outline-3">
<h3 id="org674b13f"><span class="section-number-3">3.5</span> youtube embed</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">defvar</span> <span style="color: #9CAABB;">yt-iframe-format</span>
  <span style="color: #56697A;">;; </span><span style="color: #56697A;">You may want to change your width and height.</span>
  (concat <span style="color: #7FA0B7;">"&lt;iframe width=\"440\""</span>
          <span style="color: #7FA0B7;">" height=\"335\""</span>
          <span style="color: #7FA0B7;">" src=\"https://www.youtube.com/embed/%s\""</span>
          <span style="color: #7FA0B7;">" frameborder=\"0\""</span>
          <span style="color: #7FA0B7;">" allowfullscreen&gt;%s&lt;/iframe&gt;"</span>))

(org-add-link-type
 <span style="color: #7FA0B7;">"yt"</span>
 (<span style="color: #5EC4FF;">lambda</span> (handle)
   (browse-url
    (concat <span style="color: #7FA0B7;">"https://www.youtube.com/embed/"</span>
            handle)))
 (<span style="color: #5EC4FF;">lambda</span> (path desc backend)
   (<span style="color: #5EC4FF;">cl-case</span> backend
     (html (format yt-iframe-format
                   path (<span style="color: #5EC4FF;">or</span> desc <span style="color: #7FA0B7;">""</span>)))
     (latex (format <span style="color: #7FA0B7;">"</span><span style="color: #EBBF83;">\</span><span style="color: #7FA0B7;">href{%s}{%s}"</span>
                    path (<span style="color: #5EC4FF;">or</span> desc <span style="color: #7FA0B7;">"video"</span>))))))
</pre>
</div>

<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/lEljKc9ZtU8" frameborder="0" allowfullscreen></iframe>
</p>
</div>
</div>
</div>
