emacsy/doodoo.html
<div id="outline-container-org3a05fcf" class="outline-2">
<h2 id="org3a05fcf"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> snippets</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #56697A;">;; </span><span style="color: #56697A;">Develop in ~/emacs.d/mysnippets, but also</span>
<span style="color: #56697A;">;; </span><span style="color: #56697A;">try out snippets in ~/Downloads/interesting-snippets</span>
(<span style="color: #5EC4FF;">setq</span> yas-snippet-dirs '(<span style="color: #7FA0B7;">"~/dotfiles/emacsy/mysnippets"</span>
                           <span style="color: #7FA0B7;">"~/dotfiles/emacsy/interesting-snippets"</span>))

<span style="color: #56697A;">;; </span><span style="color: #56697A;">OR, keeping YASnippet defaults try out ~/Downloads/interesting-snippets</span>
(<span style="color: #5EC4FF;">setq</span> yas-snippet-dirs (append yas-snippet-dirs
                               '(<span style="color: #7FA0B7;">"~/Downloads/interesting-snippets"</span>)))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">yasnippet</span>)
(<span style="color: #5EC4FF;">use-package</span> yasnippet-snippets)
(<span style="color: #5EC4FF;">require</span> '<span style="color: #D95468;">helm-c-yasnippet</span>)
(<span style="color: #5EC4FF;">setq</span> helm-yas-space-match-any-greedy t)
(global-set-key (kbd <span style="color: #7FA0B7;">"C-c y"</span>) 'helm-yas-complete)
(yas-global-mode <span style="color: #E27E8D; font-weight: bold;">1</span>)
(yas-load-directory <span style="color: #7FA0B7;">"~/dotfiles/emacsy/mysnippets"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-org905d999" class="outline-2">
<h2 id="org905d999"><span class="section-number-2">5</span> keybindings</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="color: #7FA0B7;">"M-p l"</span>) 'org-cliplink)
</pre>
</div>
</div>
</div>


<div id="outline-container-org3f732e9" class="outline-2">
<h2 id="org3f732e9"><span class="section-number-2">6</span> evil&#xa0;&#xa0;&#xa0;<span class="tag"><span class="interactive">interactive</span></span></h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">use-package</span> evil-org
  <span style="color: #5EC4FF;">:commands</span> evil-org-mode
  <span style="color: #5EC4FF;">:after</span> org
  <span style="color: #5EC4FF;">:init</span>
  (add-hook 'org-mode-hook 'evil-org-mode))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #5EC4FF;">evil-define-key</span> 'normal evil-org-mode-map
  <span style="color: #7FA0B7;">"&lt;"</span> 'org-metaleft
  <span style="color: #7FA0B7;">"&gt;"</span> 'org-metaright
  <span style="color: #7FA0B7;">"-"</span> 'org-cycle-list-bullet
  (kbd <span style="color: #7FA0B7;">"TAB"</span>) 'org-cycle)
<span style="color: #56697A;">;; </span><span style="color: #56697A;">normal &amp; insert state shortcuts.</span>
(mapc (<span style="color: #5EC4FF;">lambda</span> (state)
        (<span style="color: #5EC4FF;">evil-define-key</span> state evil-org-mode-map
          (kbd <span style="color: #7FA0B7;">"M-l"</span>) 'org-metaright
          (kbd <span style="color: #7FA0B7;">"M-h"</span>) 'org-metaleft
          (kbd <span style="color: #7FA0B7;">"M-k"</span>) 'org-metaup
          (kbd <span style="color: #7FA0B7;">"M-j"</span>) 'org-metadown
          (kbd <span style="color: #7FA0B7;">"M-L"</span>) 'org-shiftmetaright
          (kbd <span style="color: #7FA0B7;">"M-H"</span>) 'org-shiftmetaleft
          (kbd <span style="color: #7FA0B7;">"M-K"</span>) 'org-shiftmetaup
          (kbd <span style="color: #7FA0B7;">"M-J"</span>) 'org-shiftmetadown))
      '(normal insert))
</pre>
</div>

<p>
*
</p>
</div>
</div>



<div id="outline-container-org54826fb" class="outline-2">
<h2 id="org54826fb"><span class="section-number-2">7</span> configs</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://emacs.christianbaeuerlein.com/my-org-config.html">https://emacs.christianbaeuerlein.com/my-org-config.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Frederic Boileau</p>
<p class="date">Created: 2019-07-18 Thu 00:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
